
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2023.2.307.5.10
# Date: 2024-11-09 23:11

# Copyright (C) 2013 - 2023 Efinix Inc. All rights reserved.

# Device: T35F324
# Project: soc
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 2.5000 my_ddr_pll_CLKOUT0
create_clock -period 10.0000 io_memoryClk
create_clock -period 10.0000 io_systemClk

# GPIO Constraints
####################
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~43}] -max 0.610 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~43}] -min -0.085 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~41}] -max 0.610 [get_ports {system_spi_0_io_ss}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~41}] -min -0.085 [get_ports {system_spi_0_io_ss}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_writeEnable}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_read}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_writeEnable}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_writeEnable}]
set_input_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~66}] -max 0.858 [get_ports {system_spi_0_io_data_0_read}]
set_input_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~66}] -min 0.429 [get_ports {system_spi_0_io_data_0_read}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~67}] -max 0.610 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~67}] -min -0.085 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~67}] -max 0.603 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~67}] -min -0.087 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_input_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~69}] -max 0.858 [get_ports {system_spi_0_io_data_1_read}]
set_input_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~69}] -min 0.429 [get_ports {system_spi_0_io_data_1_read}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~70}] -max 0.610 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~70}] -min -0.085 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~70}] -max 0.603 [get_ports {system_spi_0_io_data_1_writeEnable}]
set_output_delay -clock io_systemClk -reference_pin [get_ports {io_systemClk~CLKOUT~1~70}] -min -0.087 [get_ports {system_spi_0_io_data_1_writeEnable}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_asyncResetn}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_asyncResetn}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_jtag_tck}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_jtag_tck}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_jtag_tdi}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_jtag_tdi}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_jtag_tms}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_jtag_tms}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_uart_0_io_rxd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_uart_0_io_rxd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_jtag_tdo}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_jtag_tdo}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {memoryCheckerPass}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {memoryCheckerPass}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[3]}]

# LVDS Rx Constraints
####################

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.111 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.053 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.231 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.321 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# DDR Constraints
#####################
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_burst[1] io_ddrA_arw_payload_burst[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_burst[1] io_ddrA_arw_payload_burst[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_lock[1] io_ddrA_arw_payload_lock[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_lock[1] io_ddrA_arw_payload_lock[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_size[2] io_ddrA_arw_payload_size[1] io_ddrA_arw_payload_size[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_size[2] io_ddrA_arw_payload_size[1] io_ddrA_arw_payload_size[0]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 2.500 [get_ports {io_ddrA_w_valid}]
set_output_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min -0.400 [get_ports {io_ddrA_w_valid}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_r_payload_resp[1] io_ddrA_r_payload_resp[0]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_r_payload_resp[1] io_ddrA_r_payload_resp[0]}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -max 3.000 [get_ports {io_ddrA_w_ready}]
set_input_delay -clock io_memoryClk -reference_pin [get_ports {io_memoryClk~CLKOUT~129~148}] -min 1.500 [get_ports {io_ddrA_w_ready}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {my_ddr_pll_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {my_ddr_pll_CLKOUT0}]
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {io_memoryClk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {io_memoryClk}]
# set_clock_latency -source -setup <board_max + 1.476> [get_ports {io_systemClk}]
# set_clock_latency -source -hold <board_min + 0.738> [get_ports {io_systemClk}]
